In [1]:
import pandas as pd
import numpy as np

# Learning Objectives

**Summarizing and Computing Descriptive Statistics**

**Unique values,Value Counts**

# Summarizing and Computing Descriptive Statistics

**.sum()**
**.mean()**
**.idxmax()**
**.describe()**

In [3]:
df =pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

In [4]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()# or  df.sum(axis=1)

one    9.25
two   -5.80
dtype: float64

In [9]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [8]:
df.mean(axis=1,skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [7]:
df.idxmax()

one    b
two    d
dtype: object

In [40]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

# Correlation and Covariance

**.corr()**

**.cov()**

In [66]:
df=pd.DataFrame(np.random.randint(100,size=(4,4)),index=['1','2','3','4'],columns=['a','b','c','d'])

In [67]:
df

    a   b   c   d
1  51  96  60  92
2  91  53  20   9
3  93  42  46   1
4   4  73  63  53

In [72]:
df.corr()

          a         b         c         d
a  1.000000 -0.621704 -0.763444 -0.649117
b -0.621704  1.000000  0.627045  0.993318
c -0.763444  0.627045  1.000000  0.708681
d -0.649117  0.993318  0.708681  1.000000

In [75]:
df.corrwith(df.b)

a   -0.621704
b    1.000000
c    0.627045
d    0.993318
dtype: float64

In [76]:
df.cov()

             a           b           c            d
a  1755.583333 -619.000000 -627.583333 -1148.416667
b  -619.000000  564.666667  292.333333   996.666667
c  -627.583333  292.333333  384.916667   587.083333
d -1148.416667  996.666667  587.083333  1782.916667

# Unique Values, Value Counts, and Membership

**.unique()**

**.value_counts()**

**.isin()**

**.apply(pd.value_counts).fillna(0)**

In [79]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [80]:
uniques = obj.unique()

In [81]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [82]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [83]:
pd.value_counts(obj.values, sort=False)

b    2
a    3
d    1
c    3
dtype: int64

In [84]:
obj.isin(['b', 'c'])

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [86]:
 data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})

In [87]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [88]:
result = data.apply(pd.value_counts).fillna(0)

In [89]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0